probonopd/Synth_Dexed/esp32/main/launchpad.cpp
/*
 * Launchpad X Hardware Abstraction
 *
 * Implements Programmer Mode management, batch SysEx LED updates,
 * coordinate mapping, and input dispatch to the step sequencer.
 */

#include "launchpad.h"
#include "step_sequencer.h"
#include "esp32_midi.h"
#include "esp32_oled.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include <string.h>

static const char *TAG = "launchpad";

/* ---- SysEx messages ---- */
static const uint8_t sysex_programmer_mode[] = {
    0xF0, 0x00, 0x20, 0x29, 0x02, 0x0C, 0x0E, 0x01, 0xF7
};

/* ---- Connection state ---- */
static volatile bool s_connected = false;

/* ---- Batch SysEx buffer ----
 * Format: F0 00 20 29 02 0C 03 [type LED color]... F7
 * Header = 7 bytes, each entry = 3 bytes, footer = 1 byte
 * Max ~80 entries = 7 + 240 + 1 = 248 bytes
 */
#define LP_BATCH_HEADER_LEN  7
#define LP_BATCH_MAX_ENTRIES 80
#define LP_BATCH_BUF_SIZE    (LP_BATCH_HEADER_LEN + LP_BATCH_MAX_ENTRIES * 3 + 1)

static uint8_t s_batch_buf[LP_BATCH_BUF_SIZE];
static int s_batch_len = 0;

/* ---- Playhead flash timing for CIRCLE mode ----
 * Show white playhead briefly when it moves to a new position
 * Flash duration: 100ms
 */
#define PLAYHEAD_FLASH_MS 100
static int s_last_playhead_step = -1;      /* Track previous playhead position */
static int64_t s_last_flash_time_us = 0;   /* When the flash started */
static uint8_t s_last_chord_root = 255;    /* Track previous chord root */
static chord_type_t s_last_chord_type = (chord_type_t)255; /* Track previous chord type */
static int64_t s_last_chord_flash_time_us = 0; /* When the chord flash started */

static bool playhead_should_flash(int current_step)
{
    if (current_step == -1) return false;
    
    int64_t now_us = esp_timer_get_time();
    
    /* If playhead moved to new position, start a fresh flash */
    if (current_step != s_last_playhead_step) {
        s_last_playhead_step = current_step;
        s_last_flash_time_us = now_us;
        return true;
    }
    
    /* Check if still within flash window */
    int64_t elapsed_us = now_us - s_last_flash_time_us;
    return elapsed_us < (PLAYHEAD_FLASH_MS * 1000LL);
}

static bool chord_should_flash(uint8_t root, chord_type_t type)
{
    int64_t now_us = esp_timer_get_time();
    
    /* If chord changed, start a fresh flash */
    if (root != s_last_chord_root || type != s_last_chord_type) {
        s_last_chord_root = root;
        s_last_chord_type = type;
        s_last_chord_flash_time_us = now_us;
        return true;
    }
    
    /* Check if still within flash window */
    int64_t elapsed_us = now_us - s_last_chord_flash_time_us;
    return elapsed_us < (PLAYHEAD_FLASH_MS * 1000LL);
}

/* ---- Drum color palette (one per track) ---- */
static const uint8_t drum_colors[SEQ_NUM_DRUM_TRACKS] = {
     5,  /*  0: Red          (Kick)          */
     9,  /*  1: Orange       (Side Stick)    */
    13,  /*  2: Yellow       (Snare)         */
    17,  /*  3: Lime         (Clap)          */
    21,  /*  4: Green        (Elec Snare)    */
    25,  /*  5: Spring       (Lo Floor Tom)  */
    29,  /*  6: Turquoise    (Closed HH)     */
    33,  /*  7: Cyan         (Hi Floor Tom)  */
    37,  /*  8: Sky          (Pedal HH)      */
    41,  /*  9: Blue         (Low Tom)       */
    45,  /* 10: Purple       (Open HH)       */
    49,  /* 11: Magenta      (Lo-Mid Tom)    */
    53,  /* 12: Pink         (Hi-Mid Tom)    */
    57,  /* 13: Peach        (Crash)         */
    96,  /* 14: Amber        (High Tom)      */
    72,  /* 15: Warm amber   (Ride)          */
};

/* ---- Velocity levels for Q4 ---- */
static const uint8_t velocity_levels[16] = {
    8, 16, 24, 32, 40, 48, 56, 64,
    72, 80, 88, 96, 104, 112, 120, 127
};

/* ---- Circle of Fifths note colors (smooth chromatic spectrum wheel) ----
 * Maps pitch class (0-11) to 12 distinct Launchpad colors forming a smooth circle
 * Colors fade around the spectrum: Red → Orange → Yellow → Green → Blue → Purple → Magenta
 * No color repeats; each pitch class gets exactly one unique color
 */
static uint8_t circle_note_color(uint8_t pitch_class)
{
    static const uint8_t color_wheel[12] = {
        LP_COLOR_RED,        /* 0: C */
        LP_COLOR_ORANGE,     /* 1: C#/Db */
        LP_COLOR_YELLOW,     /* 2: D */
        LP_COLOR_LIME,       /* 3: D#/Eb */
        LP_COLOR_GREEN,      /* 4: E */
        LP_COLOR_SPRING,     /* 5: F */
        LP_COLOR_TURQUOISE,  /* 6: F#/Gb */
        LP_COLOR_CYAN,       /* 7: G */
        LP_COLOR_SKY,        /* 8: G#/Ab */
        LP_COLOR_BLUE,       /* 9: A */
        LP_COLOR_PURPLE,     /* 10: A#/Bb */
        LP_COLOR_MAGENTA     /* 11: B */
    };
    return color_wheel[pitch_class % 12];
}

/* ================================================
 * Lifecycle
 * ================================================ */

void launchpad_init(void)
{
    s_connected = false;
    ESP_LOGI(TAG, "Launchpad abstraction initialized");
}

void launchpad_on_connect(void)
{
    s_connected = true;
    ESP_LOGI(TAG, "Launchpad connected -- entering Programmer Mode");
    launchpad_enter_programmer_mode();

    /* Brief delay for the Launchpad to process the SysEx */
    vTaskDelay(pdMS_TO_TICKS(100));

    /* Show initial display */
    launchpad_refresh_grid();
}

void launchpad_on_disconnect(void)
{
    s_connected = false;
    ESP_LOGI(TAG, "Launchpad disconnected");
}

bool launchpad_is_connected(void)
{
    return s_connected;
}

/* ================================================
 * Programmer Mode
 * ================================================ */

void launchpad_enter_programmer_mode(void)
{
    esp32_midi_usb_send_sysex(sysex_programmer_mode, sizeof(sysex_programmer_mode));
}

/* ================================================
 * Individual LED control
 * ================================================ */

void launchpad_set_pad_color(uint8_t note, uint8_t color)
{
    /* Static color: Note On, channel 1 (status 0x90) */
    esp32_midi_usb_send_msg(0x90, note, color);
}

void launchpad_set_cc_color(uint8_t cc, uint8_t color)
{
    /* CC on channel 1 (status 0xB0) */
    esp32_midi_usb_send_msg(0xB0, cc, color);
}

/* ================================================
 * Batch LED update via SysEx
 * ================================================ */

void launchpad_batch_begin(void)
{
    s_batch_buf[0] = 0xF0;
    s_batch_buf[1] = 0x00;
    s_batch_buf[2] = 0x20;
    s_batch_buf[3] = 0x29;
    s_batch_buf[4] = 0x02;
    s_batch_buf[5] = 0x0C;
    s_batch_buf[6] = 0x03;
    s_batch_len = LP_BATCH_HEADER_LEN;
}

void launchpad_batch_set(uint8_t type, uint8_t led_index, uint8_t color)
{
    if (s_batch_len + 3 >= LP_BATCH_BUF_SIZE - 1) return;
    s_batch_buf[s_batch_len++] = type;
    s_batch_buf[s_batch_len++] = led_index;
    s_batch_buf[s_batch_len++] = color;
}

void launchpad_batch_end(void)
{
    if (s_batch_len <= LP_BATCH_HEADER_LEN) return;
    s_batch_buf[s_batch_len++] = 0xF7;
    esp32_midi_usb_send_sysex(s_batch_buf, s_batch_len);
}

/* ================================================
 * Clear all LEDs
 * ================================================ */

