probonopd/Synth_Dexed/esp32/main/launchpad.cpp
    seq_mode_t mode = step_seq_get_mode();
    int playhead = step_seq_get_current_step();
    uint8_t sel_drum = step_seq_get_selected_drum();

    launchpad_batch_begin();

    if (mode == SEQ_MODE_DRUM || mode == SEQ_MODE_BOTH) {
        /* ---- Q1 + Q2: Step grid for selected drum ---- */
        for (uint8_t row = 5; row <= 8; row++) {
            for (uint8_t col = 1; col <= 8; col++) {
                int step = grid_to_step_index(row, col);
                uint8_t color = LP_COLOR_OFF;

                bool active = step_seq_drum_step_is_active(sel_drum, (uint8_t)step);

                if (step == playhead) {
                    color = active ? LP_SEQ_PLAYHEAD_HIT : LP_SEQ_PLAYHEAD;
                } else if (active) {
                    color = drum_colors[sel_drum];
                }

                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }

        /* ---- Q3: Drum pads ---- */
        for (uint8_t row = 1; row <= 4; row++) {
            for (uint8_t col = 1; col <= 4; col++) {
                int drum = q3_to_drum_index(row, col);
                uint8_t color;
                if (drum == sel_drum) {
                    color = LP_COLOR_WHITE;
                } else {
                    bool has_steps = false;
                    for (int s = 0; s < SEQ_MAX_STEPS; s++) {
                        if (step_seq_drum_step_is_active((uint8_t)drum, (uint8_t)s)) {
                            has_steps = true;
                            break;
                        }
                    }
                    color = has_steps ? drum_colors[drum] : LP_COLOR_WHITE_DIM;
                }
                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }

        /* ---- Q4: Velocity pads ---- */
        uint8_t cur_vel = step_seq_get_velocity();
        for (uint8_t row = 1; row <= 4; row++) {
            for (uint8_t col = 5; col <= 8; col++) {
                int vel_idx = q4_to_velocity_index(row, col);
                uint8_t this_vel = velocity_levels[vel_idx];
                uint8_t color;
                if (this_vel == cur_vel) {
                    color = LP_COLOR_WHITE;
                } else if (vel_idx < 4) {
                    color = LP_COLOR_RED;
                } else if (vel_idx < 8) {
                    color = LP_COLOR_ORANGE;
                } else if (vel_idx < 12) {
                    color = LP_COLOR_YELLOW;
                } else {
                    color = LP_COLOR_GREEN;
                }
                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }
    }
    else if (mode == SEQ_MODE_MELODIC) {
        /* ---- Q1+Q2: Melodic step grid ----
         * Columns = time steps (col 1-8 = steps 0-7)
         * Rows = pitch (row 5 = lowest, row 8 = highest visible) */
        uint8_t base_oct = step_seq_get_base_octave();
        (void)base_oct;
        for (uint8_t row = 5; row <= 8; row++) {
            for (uint8_t col = 1; col <= 8; col++) {
                int step = col - 1;
                uint8_t color = LP_COLOR_OFF;

                if (step == playhead) {
                    color = LP_SEQ_PLAYHEAD;
                }

                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }

        /* ---- Q3+Q4: Keyboard ---- */
        for (uint8_t row = 1; row <= 4; row++) {
            for (uint8_t col = 1; col <= 8; col++) {
                uint8_t note = keyboard_pad_to_midi_note(row, col);
                /* White keys vs black keys coloring */
                int pc = note % 12;
                bool is_black = (pc == 1 || pc == 3 || pc == 6 || pc == 8 || pc == 10);
                uint8_t color = is_black ? LP_COLOR_BLUE : LP_COLOR_WHITE_DIM;
                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }
    }
    else if (mode == SEQ_MODE_CIRCLE) {
        /* ---- Circle of Fifths chord mode ----
         * Full 8x8 grid shows chords arranged by circle of fifths.
         * Columns = circle position (left=subdominant, right=dominant)
         * Rows 1-2: Major, 3-4: Minor, 5-6: Dom7, 7-8: Min7
         * Plus 9 chord pads: 7 diatonic + bVI(borrowed) + major III
         *
         * Colors encode momentum-based suggestions:
         * - Currently playing chord = WHITE (bright)
         * - Strong suggestion (score 5) = CYAN
         * - Good suggestion (score 4) = GREEN
         * - Moderate suggestion (3) = YELLOW
         * - Weak (2) = dim ORANGE
         * - Distant (0-1) = dim
         * Tonic chord always gets a blue tint.
         * 
         * bVI and major III are shown at 50% dimmed (borrowed chords).
         */
        const harmonic_state_t *h = step_seq_get_harmonic_state();
        uint8_t cur_abs_root = (h->key + h->chord_root) % 12;
        chord_type_t cur_chord_type = h->chord_type;

        /* Rows 5-8: chord step sequencer — colored by ROOT NOTE of the chord placed at that step
         * Each step has an actual root note (0-11) and chord type
         * Playhead flashes white briefly when moving to a new position
         * (8-row)*8+(col-1) gives step index 0-31; row 8=steps 0-7 … row 5=steps 24-31. */
        {
            int cur_q = step_seq_chord_seq_current();
            for (uint8_t row = 5; row <= 8; row++) {
                for (uint8_t col = 1; col <= 8; col++) {
                    int si = (8 - row) * 8 + (col - 1);  /* 0-31 */
                    bool is_active = step_seq_chord_seq_step_active((uint8_t)si);
                    uint8_t color = LP_COLOR_OFF;
                    
                    if (cur_q == si) {
                        /* Currently playing step: show white only during brief flash */
                        if (playhead_should_flash(cur_q)) {
                            color = is_active ? LP_SEQ_PLAYHEAD_HIT : LP_SEQ_PLAYHEAD;
                        } else {
                            /* Flash expired, show the chord color instead */
                            if (is_active) {
                                uint8_t step_root = step_seq_chord_seq_step_root((uint8_t)si);
                                color = circle_note_color(step_root);
                            }
                        }
                    } else if (is_active) {
                        /* Non-playing active step: show chord color */
                        uint8_t step_root = step_seq_chord_seq_step_root((uint8_t)si);
                        color = circle_note_color(step_root);
                    }
                    launchpad_batch_set(0, lp_pad_note(row, col), color);
                }
            }
        }

        /* ---- Rows 1-4: Circle of Fifths chord grid colored by ROOT NOTE ----
         * Each pad shows a chord at a specific circle position
         * Currently playing chord flashes white briefly when it changes
         * Colors follow the smooth chromatic spectrum wheel (see circle_note_color)
         */
        for (uint8_t row = 1; row <= 4; row++) {
            for (uint8_t col = 1; col <= 8; col++) {
                uint8_t color = LP_COLOR_OFF;
                uint8_t root; chord_type_t ctype;
                if (step_seq_get_circle_chord(row, col, &root, &ctype)) {
                    if (root == cur_abs_root && ctype == cur_chord_type) {
                        /* Currently playing chord: show white only during brief flash */
                        if (chord_should_flash(cur_abs_root, cur_chord_type)) {
                            color = LP_CURRENT_CHORD;   /* white: currently playing */
                        } else {
                            /* Flash expired, show the chord color instead */
                            color = circle_note_color(root);
                        }
                    } else {
                        /* Color by the chord's ROOT NOTE (pitch class) */
                        color = circle_note_color(root);
                    }
                }
                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
        }
    }
    else if (mode == SEQ_MODE_FIELD) {
        /* ---- Melodic Field mode (2 rows per octave, 12 chromatic tones) ----
         * All 8 rows used (rows 7-8 = 4th octave).
         * Odd rows (1,3,5,7):  semitones 0-5  (C through F)
         * Even rows (2,4,6,8): semitones 6-11 (F# through B)
         * Row pairs: (1-2, 3-4, 5-6, 7-8) = octaves (base, base+1, base+2, base+3)
         *
         * Only harmonic notes (chord/scale) are lit. Non-harmonic notes are off.
         */
        const harmonic_state_t *h = step_seq_get_display_harmonic_state();
        uint8_t abs_chord_root = (h->key + h->chord_root) % 12;

