probonopd/Synth_Dexed/esp32/main/launchpad.cpp
        for (uint8_t row = 1; row <= 8; row++) {
            for (uint8_t col = 1; col <= 6; col++) {
                uint8_t note = step_seq_get_field_note(row, col);
                uint8_t pc = note % 12;
                uint8_t color;

                /* Root of current chord = brightest blue */
                if (pc == abs_chord_root) {
                    color = LP_CHORD_ROOT;
                }
                /* Other chord tones = green */
                else if (step_seq_is_chord_tone(pc, abs_chord_root, h->chord_type)) {
                    color = LP_CHORD_TONE;
                }
                /* Scale tones = yellow (appears at tension >= 1) */
                else if (h->tension >= 1 && step_seq_is_scale_tone(pc, h->key, h->scale_type)) {
                    color = LP_SCALE_TONE;
                }
                /* Tension tones = orange (appears at tension >= 2) */
                else if (h->tension >= 2) {
                    color = LP_TENSION_TONE;
                }
                /* Non-harmonic (avoid) notes are OFF - not lit */
                else {
                    color = LP_COLOR_OFF;
                }

                launchpad_batch_set(0, lp_pad_note(row, col), color);
            }
            /* Cols 7-8 always off */
            launchpad_batch_set(0, lp_pad_note(row, 7), LP_COLOR_OFF);
            launchpad_batch_set(0, lp_pad_note(row, 8), LP_COLOR_OFF);
        }
    }

    /* ---- Top row buttons ---- */
    launchpad_batch_set(0, LP_CC_UP,      LP_COLOR_YELLOW);
    launchpad_batch_set(0, LP_CC_DOWN,    LP_COLOR_YELLOW);
    launchpad_batch_set(0, LP_CC_LEFT,    LP_COLOR_SKY);
    launchpad_batch_set(0, LP_CC_RIGHT,   LP_COLOR_SKY);
    launchpad_batch_set(0, LP_CC_SESSION,
        step_seq_is_playing() ? LP_COLOR_GREEN : LP_COLOR_RED);
    launchpad_batch_set(0, LP_CC_DRUMS,
        (mode == SEQ_MODE_DRUM || mode == SEQ_MODE_BOTH) ? LP_COLOR_WHITE : LP_COLOR_WHITE_DIM);
    launchpad_batch_set(0, LP_CC_KEYS,
        (mode == SEQ_MODE_MELODIC || mode == SEQ_MODE_BOTH) ? LP_COLOR_WHITE : LP_COLOR_WHITE_DIM);
    launchpad_batch_set(0, LP_CC_USER, LP_COLOR_OFF);

    /* ---- Right column buttons: mode indicators ---- */
    bool is_seq = (mode == SEQ_MODE_DRUM || mode == SEQ_MODE_MELODIC || mode == SEQ_MODE_BOTH);
    launchpad_batch_set(0, LP_CC_MODE_SEQ,
        is_seq ? LP_MODE_ACTIVE : LP_MODE_INACTIVE);
    launchpad_batch_set(0, LP_CC_MODE_CIRCLE,
        (mode == SEQ_MODE_CIRCLE) ? LP_COLOR_BLUE : LP_MODE_INACTIVE);
    launchpad_batch_set(0, LP_CC_MODE_FIELD,
        (mode == SEQ_MODE_FIELD) ? LP_COLOR_GREEN : LP_MODE_INACTIVE);
    
    /* Key selection indicator: color represents key */
    if (mode == SEQ_MODE_CIRCLE || mode == SEQ_MODE_FIELD) {
        const harmonic_state_t *h = step_seq_get_harmonic_state();
        /* Colors cycle through palette for different keys */
        static const uint8_t key_colors[12] = {
            LP_COLOR_WHITE, LP_COLOR_RED, LP_COLOR_ORANGE, LP_COLOR_YELLOW,
            LP_COLOR_LIME, LP_COLOR_GREEN, LP_COLOR_CYAN, LP_COLOR_BLUE,
            LP_COLOR_PURPLE, LP_COLOR_MAGENTA, LP_COLOR_PINK, LP_COLOR_PEACH
        };
        launchpad_batch_set(0, LP_CC_KEY_SELECT, key_colors[h->key]);
        
        /* Scale type indicator */
        static const uint8_t scale_colors[SCALE_TYPE_COUNT] = {
            LP_COLOR_WHITE, LP_COLOR_BLUE, LP_COLOR_GREEN, LP_COLOR_ORANGE,
            LP_COLOR_PURPLE, LP_COLOR_YELLOW, LP_COLOR_RED, LP_COLOR_CYAN,
            LP_COLOR_MAGENTA
        };
        launchpad_batch_set(0, LP_CC_SCALE_SELECT, scale_colors[h->scale_type]);
        
        /* Tension level indicator */
        static const uint8_t tension_colors[4] = {
            LP_COLOR_GREEN, LP_COLOR_YELLOW, LP_COLOR_ORANGE, LP_COLOR_RED
        };
        launchpad_batch_set(0, LP_CC_TENSION, tension_colors[h->tension]);
        
        launchpad_batch_set(0, LP_CC_RECORD_PROG, LP_COLOR_WHITE_DIM);
        launchpad_batch_set(0, LP_CC_CLEAR, LP_COLOR_RED);
    } else {
        /* In sequencer modes, right column buttons 4-8 are dimmed */
        launchpad_batch_set(0, LP_CC_KEY_SELECT, LP_COLOR_OFF);
        launchpad_batch_set(0, LP_CC_SCALE_SELECT, LP_COLOR_OFF);
        launchpad_batch_set(0, LP_CC_TENSION, LP_COLOR_OFF);
        launchpad_batch_set(0, LP_CC_RECORD_PROG, LP_COLOR_OFF);
        launchpad_batch_set(0, LP_CC_CLEAR, LP_COLOR_OFF);
    }

    /* Novation logo: blink bright green on quarter-note beats when sequencer running */
    {
        int cs = step_seq_get_current_step();
        uint8_t logo_color = LP_COLOR_OFF;
        if (step_seq_is_playing() && cs >= 0 && (cs % 4 == 0)) {
            logo_color = LP_SEQ_PLAYHEAD_HIT;
        }
        launchpad_batch_set(0, LP_LOGO_NOTE, logo_color);
    }

    launchpad_batch_end();
}

/* ================================================
 * Input dispatch
 * ================================================ */

void launchpad_handle_note(uint8_t note, uint8_t velocity)
{
    uint8_t row = lp_note_row(note);
    uint8_t col = lp_note_col(note);

    if (!lp_is_grid(row, col)) return;

    if (velocity > 0) {
        step_seq_handle_grid_press(row, col, velocity);
    } else {
        step_seq_handle_grid_release(row, col);
    }
}

void launchpad_handle_cc(uint8_t cc, uint8_t value)
{
    /* Forward both press (value>0) and release (value==0) so that
     * step_seq_handle_button can track button-hold state for SEQ_MODE_BOTH. */
    step_seq_handle_button(cc, value);
}
